Белгипрозем_2017/src/Catalogs/НастройкиДоступностиПоСостоянию/НастройкиДоступностиПоСостоянию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиДоступностиПоСостоянию</name>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантНастройкиДляВидовДокументов</name>
    <type>
      <types>EnumRef.ВариантыНастройкиДоступностиДляВидовДокументов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИспользоватьДля</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.ГруппыДоступа</types>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>String</types>
        <types>CatalogRef.Пользователи</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОсновнойОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиДоступности</name>
    <attributes>
      <name>ИмяПоляКоманды</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Доступность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Enums/ТипыОбъектов/ТипыОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектов</name>
  <enumValues>
    <name>ВнутренниеДокументы</name>
  </enumValues>
  <enumValues>
    <name>ВходящиеДокументы</name>
  </enumValues>
  <enumValues>
    <name>ИсходящиеДокументы</name>
  </enumValues>
  <enumValues>
    <name>Контрагенты</name>
  </enumValues>
  <enumValues>
    <name>Мероприятия</name>
  </enumValues>
  <enumValues>
    <name>Файлы</name>
  </enumValues>
  <enumValues>
    <name>Проекты</name>
  </enumValues>
  <enumValues>
    <name>ПроектныеЗадачи</name>
  </enumValues>
</mdclass:Enum>

Белгипрозем_2017/src/Catalogs/НастройкиДоступностиПоСостоянию/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипыДокументов.Добавить(Перечисления.ТипыОбъектов.ВходящиеДокументы, НСтр("ru = 'Входящие документы'"));
	ТипыДокументов.Добавить(Перечисления.ТипыОбъектов.ИсходящиеДокументы, НСтр("ru = 'Исходящие документы'"));
	ТипыДокументов.Добавить(Перечисления.ТипыОбъектов.ВнутренниеДокументы, НСтр("ru = 'Внутренние документы'"));
	
	ТекущийТипДокумента = ТипыДокументов[0].Значение;
	Элементы.ТипыДокументов.ТекущаяСтрока = ТипыДокументов[0].ПолучитьИдентификатор();
	УстановитьОтборСписка(Список, ТекущийТипДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыДокументовПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ТипыДокументов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Значение = ТекущийТипДокумента Тогда 
		Возврат;
	КонецЕсли;	
	
	ТекущийТипДокумента = ТекущиеДанные.Значение;
	
	УстановитьОтборСписка(Список, ТекущийТипДокумента);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ТекущийТипДокумента = Настройки["ТекущийТипДокумента"];
	Если Не ЗначениеЗаполнено(ТекущийТипДокумента) Тогда 
		Возврат;
	КонецЕсли;	
	
	НайденноеЗначение = ТипыДокументов.НайтиПоЗначению(ТекущийТипДокумента);
	Если НайденноеЗначение = Неопределено Тогда 
		Возврат;
	КонецЕсли;	
		
	Элементы.ТипыДокументов.ТекущаяСтрока = НайденноеЗначение.ПолучитьИдентификатор();
	
	УстановитьОтборСписка(Список, ТекущийТипДокумента);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Список, ТекущийТипДокумента)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор,
		"ТипДокумента",
		ТекущийТипДокумента);
	
КонецПроцедуры
